## Staging: iam
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                             NAME                             |
|--------|--------------------------------------------------------------|
| add    | `aws_iam_policy.feedback-cronjob-ssm-policy`                 |
|        | `aws_iam_policy_attachment.feedback-cronjob-ssm-policy`      |
|        | `aws_iam_role.feedback-cronjob-ecs-role`                     |
|        | `aws_iam_role_policy_attachment.feedback-cronjob-ecs-policy` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.feedback-cronjob-ssm-policy will be created
  + resource "aws_iam_policy" "feedback-cronjob-ssm-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for feedback-cronjob staging to access SSM parameters"
      + id               = (known after apply)
      + name             = "feedback-cronjob-ssm-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParametersByPath",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = ""
                      + Sid      = "AllowSSMParameterAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + tags_all         = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy_attachment.feedback-cronjob-ssm-policy will be created
  + resource "aws_iam_policy_attachment" "feedback-cronjob-ssm-policy" {
      + id         = (known after apply)
      + name       = "feedback-cronjob-ssm-policy"
      + policy_arn = (known after apply)
      + roles      = [
          + "feedback-cronjob-ecs-role",
        ]
    }

  # aws_iam_role.feedback-cronjob-ecs-role will be created
  + resource "aws_iam_role" "feedback-cronjob-ecs-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "feedback-cronjob-ecs-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "CostCentre" = "feedback-cronjob-staging"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.feedback-cronjob-ecs-policy will be created
  + resource "aws_iam_role_policy_attachment" "feedback-cronjob-ecs-policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "feedback-cronjob-ecs-role"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ecs_role_arn  = (known after apply)
  + ecs_role_name = "feedback-cronjob-ecs-role"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.feedback-cronjob-ecs-role"]

20 tests, 19 passed, 1 warning, 0 failures, 0 exceptions

```

</details>
